Please be informed it is not just for SRV records, I saw the same behavior on CAA records as well. (any record that has "data block" on the tofu config)

# module.dns_records.cloudflare_dns_record.caa_example_issuewild will be updated in-place
  ~ resource "cloudflare_dns_record" "caa_example_issuewild" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "0 issuewild \"example.com\"" -> (known after apply)
      ~ created_on          = "2025-02-28T15:09:43Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + size           = 0
            # (3 unchanged attributes hidden)
        }
        id                  = "62fd7b417d7ef9jbae365e851f873b27"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified

_on         = "2025-02-28T15:09:43Z" -> (known after apply)
        name                = "example.com"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }